[
    {
        "cardProps": {
            "name": "Discover Olvera",
            "image": "/work/discover-olvera/discover-olvera-cover.png",
            "page": "/work/discover-olvera",
            "labels": [
                "ethnography",
                "netnography",
                "prototyping",
                "user testing",
                "animated logo"
            ]
        },
        "contextMenuData": {
            "props": {
                "header": "Discover Olvera",
                "subHeader": [
                    "IXD STUDIO 1",
                    "FALL 2023"
                ],
                "mainText": "A mobile app that aims to increase foot traffic at Olvera street by gamifying the visitor experience using augmented reality."
            }
        },
        "sections": [
            {
                "key": "overview",
                "componentType": "caseStudyOverview",
                "props": {
                    "bullets": [
                        [
                            "Problem: ",
                            "Olvera Street's businesses are suffering due to a lingering, pandemic-enduced drop in foot traffic"
                        ],
                        [
                            "Process: ",
                            "Ethnography, Netnography, Prototype, Test, Refine"
                        ],
                        [
                            "Team: ",
                            "Erick Olivares, Ian Goldstein, Tony Renoj, Myself"
                        ],
                        [
                            "Role: ",
                            "Design Research, Branding, UX Design"
                        ]
                    ],
                    "image": "/work/discover-olvera/discover-olvera-cover.png"
                }
            },
            {   
                "key": "research",
                "componentType": "caseStudyChapter",
                "title": "Research"
            },
            {
                "key": "observations",
                "componentType": "caseStudySection",
                "sectionHeader": "Ethnography: Observations",
                "mainText": "Our first form of research was to visit Olvera Street in person. The goal was to unearth problems through observation",
                "bullets": [
                    "Six shops and one popular resturant were closed down.",
                    "There were many transient individuals within Olvera Street, and we witnessed an attempted theft - perhaps they feel emboldened to steal because of the low foot traffic.",
                    "Olvera Street is part of a slightly larger area known as Placita Olvera, which houses five small museums. These Museums are under-promoted, gaining most visitors through outdoor signs, scheduled visits from guided tours, and seasonal events."
                ],
                "images": [
                    [
                        "/work/discover-olvera/firehouse-museum.png",
                        "Exterior view of the Firehouse Museum. It is an old-fashioned brick building in a cobblestone plaza",
                        "The Firehouse Museum, one of many hidden gems of Placita Olvera"
                    ],
                    [
                        "/work/discover-olvera/olvera-empty.png",
                        "Vacant shops at Olvera Street",
                        "Vacant shops at Olvera Street"           
                    ]
                ]
            },
            {
                "key": "interviews",
                "componentType": "caseStudySection",
                "sectionHeader": "Ethnography: Interviews",
                "mainText": "In addition to observations, we interviewed 7 vendors, 5 visitors, and 2 museum clerks.",
                "bullets": [
                    "All vendors concurred that they have not recovered economically from Covid.",
                    "The Museums have a lot to offer but are mainly promoted through entrance signage. They are hidden gems",            
                    "Frequent visitors tend to naturally promote Olvera street to their friends and family."
                ],
                "images": [
                    [
                        "/work/discover-olvera/museum-of-social-justice.png",
                        "Entrance to the Museum of Social Justice",
                        "Another one of Placita Olvera's hidden gems"
                    ], 
                    [
                        "/work/discover-olvera/mural-a.jpg",
                        "The mural 'America Tropical' by David Alfaro Siquieros",
                        "'America Tropical', a mural by David Alfaro Siquieros, lies right in the center of Olvera Street but can only be viewed from a one particular balcony"
                    ]
                ]
            },
            {
                "key": "netnography",
                "componentType": "caseStudySection",
                "sectionHeader": "Netnography",
                "mainText": "Next, we took an in-depth look at the online presence of Olvera Street. We investigated what’s said about Olvera on Yelp, Tripadvisor, and in the news. We also looked what others have already done to solve similar challenges.",
                "bullets": [
                    "The Met used an AR app to enhance artwork and draw the crowds back after Covid. Should we use AR to increase foot traffic at Olvera?",
                    "Placita Olvera has poor internet representation. For example, many shops are not represented on Google Maps",            
                    "We found qualitative data that confirmed our ethnography, such as the fact that businesses are currently down 30-60%",
                    "Journalist Javier Cabral suggests that leveraging social media could be a solution. How might this look in our project?"
                ],
                "images": [
                    [
                        "/work/discover-olvera/chroma.png",
                        "Image of text reading 'Chroma: ancient sculpture in color' in front of a Sphinx sculpture",
                        "Poster for Chroma AR by The MET"
                    ], 
                    [
                        "/work/discover-olvera/google-maps.png",
                        "Screenshot of Olvera Street on Google maps",
                        "Many businesses at Olvera are not displayed on Google and Apple maps."
                    ]
                ]
            },
            {
                "key": "how-might-we",
                "componentType": "caseStudyBigText",
                "secondaryText": "After reviewing our data, a design direction emerged:",
                "primaryText": "How might we leverage Olvera's hidden museums and it's small yet loyal customer base to increase foot traffic at Olvera Street?"
            },
            {
                "key": "persona",
                "componentType": "caseStudySection",
                "sectionHeader": "Persona",
                "mainText": "We created a persona named Jessica based on the visitors that we interviewed. Our design, whatever it would end up being, would focus on bringing her pysically to Olvera Street.",
                "images": [
                    [
                        "/work/discover-olvera/persona-left.png",
                        "Screenshot of the Jessica Persona"
                    ], 
                    [
                        "/work/discover-olvera/persona-right.png",
                        "Screenshot of the Jessica Persona"
                    ]
                ]
            },
            {   
                "key": "design",
                "componentType": "caseStudyChapter",
                "title": "Design"
            },
            {
                "key": "paper-prototype",
                "componentType": "caseStudySection",
                "sectionHeader": "Paper Prototype",
                "mainText": "The first iteration of our solution was a system consisting of several digital and physical components.",
                "bullets": [
                    "App: An app with a detailed map of Olvera’s attractions, as well as AR experiences.",
                    "Digital Displays: Users would have the opportunity to post photos of their experiences to digital displays on billboards in public.",            
                    "QR Codes: QR codes at Olvera street would have to be scanned to download the app and activate the AR experiences."
                ],
                "images": [
                    [
                        "/work/discover-olvera/paper-prototype.png",
                        "The app prototype, made of paper and lego",
                        "Lego makes a great prototyping material!"
                    ], 
                    [
                        "/work/discover-olvera/camera-sim.png",
                        "The app prototype, made of paper and lego",
                        "Simulating an AR-colorized mural"
                    ],
                    [
                        "/work/discover-olvera/prototype-map.png",
                        "The app prototype, made of paper and lego",
                        "Simulating physical movement around the location"
                    ]
                ]
            },
            {
                "key": "prototype-insights",
                "componentType": "caseStudyInsights",
                "title": "Insights",
                "caption": "Several usability tests of our paper prototype revealed these insights:",
                "insights": [
                    [
                        "Comfort Levels",
                        "All of our participants said that they would be uncomfortable sharing their photos to public displays and billboards."
                    ],
                    [
                        "America Tropical",
                        "We prototyped three AR experiences, and the most delightful was the one that displayed America Tropical, a white-washed mural, in its original colors."
                    ],
                    [
                        "Emphasize AR",
                        "The user flow needs to culminate in sharing AR experiences, rather than just having them."
                    ]
                ]
            },
            {
                "key": "mid-fi-prototype",
                "componentType": "caseStudySection",
                "sectionHeader": "Mid-Fi Prototype",
                "mainText": "We used our insights to design an interactive mid-fidelity prototype in Figma.",
                "bullets": [
                    "We discarded the idea of sharing photos to public digital displays. Instead, we aimed to provoke users to share their experiences on their own social media. This would be done by rewarding users with camera filters for participtation in AR experiences.",
                    "We built out the AR mural feature to include a variety of interactions.",            
                    "We made the AR more prominent from the very beginning of the user journey"
                ],
                "images": [
                    [
                        "/work/discover-olvera/broken-statues.png",
                        "A screen from the app showing an AR enhanced mural.",
                        "One of our new features for the mural was informative popovers."
                    ] 
                ]
            },
            {
                "key": "mid-fi-insights",
                "componentType": "caseStudyInsights",
                "title": "Insights",
                "caption": "Several usability tests of our first Figma prototype revealed these insights:",
                "insights": [
                    [
                        "Tutorial",
                        "Many of the participants in our digital usability tests suggested including some kind of tutorial or abundance of tooltips."            
                    ],
                    [
                        "Simplify",
                        "Several participants mentioned that there were too many clicks in the map and the tutorial"            
                    ],
                    [
                        "Delighted by AR",
                        "Our participants cherished all of the new AR mural features, suggesting that this formula be applied to other muesum exhibits at Olvera."            
                    ],
                    [
                        "Be careful about Spanish phrases",
                        "Our prototype had some phrases like 'Vamos!'. Some participants said they didn't understand what these phrases meant and that they would look for a way to switch to English."
                    ]
                ]
            },
            {   
                "key": "branding",
                "componentType": "caseStudySection",
                "sectionHeader": "Branding",
                "mainText": "I designed all aspects of the brand with feedback from my team. Like the structure and UI of the app, the branding went through a sustained iterative process.",
                "bullets": [
                    "The interviews with vendors had revealed that Dia de los Muertos, as well as the movie 'Coco' generated a lot of foot traffic. We chose a style that was reminiscent of these themes, using festive colors contrasted by dark backgrounds.",
                    "Through Figma’s Material Theme Builder plugin, I was able to enter our colors and quickly customize a UI kit for our Hi-Fi wireframes."           
                ],
                "images": [
                    [
                        "/work/discover-olvera/discover-olvera-logo.png",
                        "The final logo",
                        "The final animated logo"
                    ], 
                    [
                        "/work/discover-olvera/color-palette.png",
                        "Discover Olvera color palette",
                        "Color palette for the brand"
                    ], 
                    [
                        "/work/discover-olvera/ui-colors.png",
                        "Color palette for the UI",
                        "Color palette for the app's UI"
                    ],
                    [
                        "/work/discover-olvera/olvera-logo-thumbnails.png",
                        "Thumbnail sketches for the logo",
                        "An early set of logo ideas"
                    ],
                    [
                        "/work/discover-olvera/figma-logo-ideation.png",
                        "Digital logo ideas",
                        "Later refinements of the wordmark"
                    ]
                ]
            },
            {
                "key": "hi-fi-prototype",
                "componentType": "caseStudyVideo",
                "header": "Hi-Fi Prototype and user story",
                "mainText": "Below is our final deliverable - a video showcasing our hi-fi protoype through a user story. The animated infographics at the beginning were created by myself in After Effects.",
                "src": "https://www.youtube.com/embed/ZsmuhoPbTFE"
            },
            {
                "key": "reflection",
                "componentType": "caseStudySection",
                "sectionHeader": "Reflection",
                "bullets": [
                    "This was, by far, the most research-intensive project I’ve done so far. I got to practice familiar research methods and learn a new one - ethnography. I am more confident now in my ability to design a research program and execute it, tailored to the needs of the project.",
                    "We made use of one another’s varied skillsets to share the load in a productive way. I will be looking for this kind of opportunity in future teams."
                ],
                "images": [
                    [
                        "/work/discover-olvera/team-photo.png",
                        "Team Photo",
                        "Tony, Erick, and I Discovering Olvera"
                    ]
                ]
            }
        ]
    },









    {
        "cardProps": {
            "name": "VoxAI",
            "image": "/work/voxai/voxai-exploded-view.jpg",
            "page": "/work/voxai",
            "labels": [
                "UI for AI",
                "heuristics",
                "insight sorting",
                "project management",
                "accessibility"
            ]
        },
        "contextMenuData": {
            "props": {
                "header": "VoxAI",
                "subHeader": [
                    "IXD STUDIO 2",
                    "Spring 2023"
                ],
                "mainText": "A mobile app and tablet case that improves communication for non-verbal autistic users."
            }
        },
        "sections": [
            {
                "key": "overview",
                "componentType": "caseStudyOverview",
                "props": {
                    "bullets": [
                        [
                            "Users: ",
                            "Young adults with non-verbal autism."
                        ],
                        [
                            "User Pain Point: ",
                            "AAC (Assistive + Augmentative Communication) devices often leave users unable to communicate as swiftly and personally as they need to in all contexts."
                        ],
                        [
                            "Solution: ",
                            "Use AI to enhance the standard AAC model."
                        ],
                        [
                            "Team: ",
                            "Thanh Quach, Birgess Weston,  Lois Kim, Myself"
                        ],
                        [
                            "Role: ",
                            "Project Manager, Lead UI Designer"
                        ]
                    ],
                    "image": "/work/voxai/voxai-exploded-view.jpg"
                }
            },
            {   
                "key": "research",
                "componentType": "caseStudyChapter",
                "title": "Research"
            },
            {   
                "key": "expert-interveiw",
                "componentType": "caseStudySection",
                "sectionHeader": "Expert Interveiw",
                "mainText": "We kicked off our project with an interview of an expert in AAC tech, AnnMarie Pence. She is a speech-language pathologist specializing in autism, and many of her pupils use AAC tablets and apps. She provided us with key information on the AAC landscape and common user pain points. ",                
                "bullets": [
                    "AAC apps facilitate communication for people with impaired speech due to autism, aphasia, stroke, or injury.",
                    "AAC apps are essentially keyboards representing words rather than letters. This is because users often have difficulty reading as well.",
                    "Once the user forms a desired sentence, the app can output it through an artificial voice.",
                    "The output can be enhanced through specialized cases that have speakers and a rear-facing screen for displaying text."
                    ],
                "images": [
                    [
                        "/work/voxai/ann-marie-pence.jpeg",
                        "Ann-Marie Pence",
                        "Ann-Marie Pence, speech and behavioral pathologist"
                    ], 
                    [
                        "/work/voxai/proloquo-dark-mode.png",
                        "Homepage of Proloquo, an industry leader in AAC tech.",
                        "Homepage of Proloquo, an industry leader in AAC tech."
                    ], 
                    [
                        "/work/voxai/tobii-dynavox.webp",
                        "Tobii Dynavox iPad case with a rear-facing screen",
                        "Tobii Dynavox makes AAc cases with rear-facing screens."
                    ]
                ]
            },
            {
                "key": "pain-points",
                "componentType": "caseStudyInsights",
                "title": "Pain Points",
                "caption": "Common pain points for a non-verbal autistic user:",
                "insights": [
                    [
                        "Too Slow",
                        "Conversations held using AAC apps tend to be too slow because it takes time to find the right words within the app. Finding the right word is much like digging through folders in a computer’s file system."                    
                    ],
                    [
                        "Lack of personal touch",
                        "While users have some customizability over the vocal output, it sounds monotone and artificial. Users desire to use slang and emotional tones."                    
                    ],
                    [
                        "Dependence",
                        "Users can often only communicate with caregivers and people who understand AAC apps. Non-familar listeners often walk away from the conversation before it is over because the user can take a long time to respond."
                    ],
                    [
                        "Rigidity",
                        "Default words do not accommodate peculiar situations. If a user knows they are going to need a ‘fringe word’, they need to make a custom button ahead of time. Unexpected necessity of fringe words stalls conversations."
                    ]
                ]
            },
            {
                "key": "how-might-we",
                "componentType": "caseStudyBigText",
                "secondaryText": "Based on our research, we saw a clear design direction:",
                "primaryText": "How might we enhance the standard AAC model to help young adults with non-verbal autism communicate more swiftly, personally, independently, and versatilely?"
            },
            {
                "key": "ai-landscape",
                "componentType": "caseStudyBillBoard",
                "header": "AI Landscape",
                "mainText": "We began to imagine that AI could be implemented into the solution, but needed a concrete understanding of what opportunities within AI were realistic. A ‘From…To’ map is useful for making predictions based on current trends - just what we needed.",
                "src": "/work/voxai/from-to.png"
            },
            {
                "key": "Insights",
                "componentType": "caseStudyInsights",
                "title": "Insights",
                "caption": "Relevant insights uncovered by the From-To map:",
                "insights": [
                    [
                        "Multimodality",
                        "There is an increase in the ability for a single model can more easily combine different kinds of media as input and output."                    
                    ],
                    [
                        "Democratization",
                        "Many companies are opting to use locally run, privately owned small language models because they are easier to manipulate, better at specific tasks, and cheaper."                    
                    ]
                ]
            },
            {
                "key": "Insights",
                "componentType": "caseStudyInsights",
                "title": "Designing for Autistic Users",
                "caption": "Our interview with AnnMarie, as well as desktop research, revealed common heuristics for autistic users. They are mainly centered around avoiding overstimulation. While some of them align with typical design practices, many don’t. This was therefore an exercise in setting aside familiar practices in an effort to empathize.",
                "insights": [
                    [
                        "Layout",
                        "Layouts should be simple and hierarchical. Fanciful typographical tricks/animation should be avoided. Layout should be consistent across all pages without any major changes. There should only be one navigation toolbar."                    ],
                    [
                        "Colors",
                        "Colors should be muted, not bright. Stark color contrast should be avoided. "
                    ],
                    [
                        "Be Literal",
                        "Avoid using figurative language. Accompany icons with text in order to avoid ambiguity."
                    ]
                ]
            },
            {   
                "key": "precedent-exploration",
                "componentType": "caseStudySection",
                "sectionHeader": "Precedent Exploration",
                "mainText": "We analyzed the two most popular AAC apps in order to understand what opportunities for improvement exist concerning UI and what standards exist for such a niche user group. We decided to keep the following aspects of the typical AAC structure within our own UI",
                "bullets": [
                    "AAC apps adhere to the ‘Fistzgerald Key’ or a modified Fitzgerald Key in order to color code word types.",
                    "The typical ‘masonry’ layout of ordinary keyboards can be jarring to autistic users. A gridded keyboard layour is optimal.",
                    "Keys can be either represent words or word categories, much like how a computer’s file system has files and folders."
                ],         
                "images": [
                    [
                        "/work/voxai/fitzgerald-key.png",
                        "The modified Fitzgerald Key used by Proloquo",
                        "The modified Fitzgerald Key used by Proloquo"                        
                    ], 
                    [
                        "/work/voxai/lamp-home-screen.png",
                        "Lamp‘s homescreen.",
                        "Lamp‘s homescreen, with a gridded key layout."
                    ], 
                    [
                        "/work/voxai/proloquo-button-types.png",
                        "A sample of Proloquo's buttons",
                        "Proloquo's keys represent either words or folders."
                    ]
                ]
            }
        ]
    },
    {
        "cardProps": {
            "name": "SlimBox",
            "image": "/work/slimbox/slimbox-cover.png",
            "page": "/work/slimbox",
            "labels": [
                "SWOT",
                "micro-interactions",
                "precedent exploration"
            ]
        },
        "contextMenuData": {
            "props": {
                "header": "SlimBox",
                "subHeader": [
                    "IxD Studio 2",
                    "Spring 2024"
                ],
                "mainText": "A UI concept helping users keep their inbox decluttered."
            }        
        },
        "sections": [
        
        ]
    },
    {
        "cardProps": {
            "name": "Other Stuff I Do",
            "image": "/work/other/other-cover.png",
            "page": "/work/other",
            "labels": [
                "typography",
                "book illustration",
                "digital art",
                "analog art"
            ]
        },
        "contextMenuData": {
            "props": {
                "header": "Other Skills",
                "subHeader": [
                    "Joey Sotelo",
                    "Design Technologist"
                ]
            }        
        },
        "sections": [
        
        ]
    }
]