{
    "meander-sim": {
        "caseStudyCardProps": {
            "name": "Alluvial Geomorphology Simulator",
            "image": "/work/meander-sim/meander-sim-cover.png",
            "page": "/work/meander-sim",
            "labels": [
                "javascript",
                "simulation",
                "educational tool"
            ]
        },       
        "sections": [
            {
                "key": "final-product",
                "componentType": "iFrame",
                "header": "Alluvial Geomorphology Simulator",
                "mainText": "An academic tool used to demonstrate the science behind the meandering of rivers. Take it for a spin!",
                "src": "https://editor.p5js.org/jsotelo/full/-_7CfZCbIR"
            },
            {   
                "key": "process",
                "componentType": "chapterHeader",
                "header": "Process"
            },
            {
                "key": "context",
                "componentType": "standardScrollSection",
                "header": "Context",
                "mainText": "For some reason, I have an fascination with rivers and the variety of shapes they form - a.k.a. alluvial geomorphology. When, in a programming class, I was tasked with creating a simulation of any kind of process, I decided to simulate the meandering of a river.",
                "images": [
                    [
                        "/work/meander-sim/braided-river.jpg",
                        "An aerial view of a meandering river"
                    ]
                ]
            },
            {
                "key": "code",
                "componentType": "column",
                "columnSections": [
                    [
                        "header",
                        "Code"
                    ],
                    [
                        "mainText",
                        "I learned that in the 1950’s, a civil engineer named Emory Lane created this formula to explain the factors and interactions behind the meandering of a river:"
                    ],
                    [
                        "bigText",
                        "Qₛ * D ∝ Qₕ * S"
                    ],
                    [
                        "mainText",
                        "...where Qₛ is the sediment density of the water, D is the median size of the sediment, Qₕ is the discharge of water, and S is the slope of the terrain. Notice that this is not necessarily an equation. Rather, the sediment side of the formula is proportional to the water side. The more disproportional the sides are, the more extreme the meandering will be."
                    ],
                    [
                        "mainText",
                        "I structured my code around this formula. The variables would be exposed to the user, who could adjust them using sliders in the UI to see how the river would respond. Below is the code that outputs the sediment/water ratio based on the user's inputs."
                    ],
                    [
                        "codeFragment",
                        "sediment = loadSlider.value() * sizeSlider.value();",
                        "water = dischargeSlider.value() * slopeSlider.value();",
                        "ratio = Math.abs(sediment - water);"
                    ],
                    [
                        "mainText",
                        "The single ratio value would influence the intensity of the meandering. A ratio of 1 is a nearly straight river. The more the value deviates from 1, the more the river will meander."
                    ],
                    [
                        "mainText",
                        "For the visual, I created a flow-field. A flow-fieid is a common way to represent waves, wind, and other forces in computer graphics. It involves a grid of vectors whose angles are dictated by a three dimensional perlin noise grid. Each frame superimposes a ‘slice’ of the noise over the flowfield, controlling the angles of the vectors. Then the noise grid is moved in the z direction and the flowfield is re-defined."
                    ],
                    [
                        "mainText",
                        "The point of the flowfield was to create semi-random forces that would affect particle objects, representing the water. Furthermore, it allowed the diversity of the vector angles, and thus the intensity of the meandering, to be controlled by the one ratio value."
                    ]
                ]
            },
            {
                "key": "code-link",
                "componentType": "bigText",
                "secondaryText": "View the rest of my code at:",
                "mainText": "https://editor.p5js.org/jsotelo/sketches/-_7CfZCbIR"
            }
        ]
    },
    "lfla": {
        "caseStudyCardProps": {
            "name": "Los Angeles Library Foundation",
            "image": "/work/lfla/lfla-cover-4.png",
            "page": "/work/lfla",
            "labels": [
                "service design",
                "motion graphics",
                "ux research"
            ]
        },
        "sections": [
            {
                "key": "overview",
                "componentType": "overview",
                "header": "LFLA Livestream Redesign",
                "descriptiveList": [
                    [
                        "Client: ",
                        "The LA Library Foundation (LFLA) and their sub-brand, Aloud. Aloud produces events in which authors, artists, and other thinkers discuss their ideas in front of in-person and virtual audiences."
                    ],
                    [
                        "Challenge: ",
                        "Help Aloud channel more of its audience to LFLA, the parent-brand. This could be measured by donations, library memberships, etc. Our class was siloed into many teams - mine focused on the livestream experience."
                    ],
                    [
                        "Solution: ",
                        "A new virtual event format that leverages YouTube’s chat features and displays branded visuals."
                    ],
                    [
                        "Role: ",
                        "UX Researcher, Motion Graphics Designer"
                    ],
                    [
                        "Team: ",
                        "Ian Goldsten, Alison Paralles"
                    ]
                ],
                "image": "/work/lfla/lfla-cover-4.png"
            },
            {   
                "key": "research",
                "componentType": "chapterHeader",
                "header": "Research"
            },
            {
                "key": "stakeholder-kickoff",
                "componentType": "standardScrollSection",
                "header": "Meeting our Stakeholders",
                "mainText": "We kicked off the project with a trip to the LA Central Library to discuss the project brief. Key insights included: ",
                "bullets": [
                    "Aloud events are live-streamed on YouTube with the chat closed.",
                    "The viewers tend to tune in and out rather than stay for the duration of the presentation.",
                    "The virtual audience tends to be people who would rather be there in-person.",
                    "LFLA does not do any research or analytics on the virtual audience."
                ],
                "images": [
                    [
                        "/work/lfla/stakeholder-meeting.jpg",
                        "The students meet with the stakeholders to discuss the project brief in the library.",
                        "Discussing the project brief with our stakeholders."
                    ],
                    [
                        "/work/lfla/stacy.jpg",
                        "Stakeholder Stacy Lieberman, President and CEO of LFLA",
                        "Stakeholder Stacy Lieberman, President and CEO of LFLA"
                    ],
                    [
                        "/work/lfla/vy.webp",
                        "Vy Pham, Director of Marketing and Communications at LFLA",
                        "Vy Pham, Director of Marketing and Communications at LFLA"
                    ],
                    [
                        "/work/lfla/jessica.jpeg",
                        "Vy Pham, Director of Marketing and Communications at LFLA",
                        "Jessica Strand, Senior Director of Programming and Strategic Engagement"
                    ],
                    [
                        "/work/lfla/tour.jpg",
                        "The students stand around one of the stakeholders as she gives them a tour of central library.",
                        "Stacy gives us a tour of central library."           
                    ]
                ]
            },
            {
                "key": "initial-research",
                "componentType": "standardScrollSection",
                "header": "Initial Research",
                "mainText": "We started with informed design, secondary research, and a competetive analysis.",
                "images": [
                    [
                        "/work/lfla/initial-research.jpg",
                        "Three posters on a wall display the initial reseaerch findings.",
                        "Our initial research findings stayed on the studio wall during the project."
                    ]
                ]
            },
            {
                "key": "initial-research-insights",
                "componentType": "insightsScrollSection",
                "header": "Initial Research Insights",
                "descriptiveList": [
                    [
                        "Virtual Q-and-A",
                        "Several other organizations have demonstrated that a virtual audience can smoothly be included in the Q-and-A at hybrid events."
                    ],
                    [
                        "Platform options",
                        "Our analysis of streaming platforms would later lead us to stick with YouTube for its built in chat features and accessibility."
                    ],
                    [
                        "Interaction and viewership",
                        "Streams that allow the viewers to co-create content with the presenters result in more repeat viewers and less dropping off."
                    ],
                    [
                        "Interaction and watch-time",
                        "Chat functionality increases watch time by 27%"
                    ],
                    [
                        "Best practices",
                        "71% of marketers use live polling/Q&A for engagement."
                    ]
                ]
            },
            {
                "key": "field-research",
                "componentType": "standardScrollSection",
                "header": "Field Research",
                "mainText": "On September 22nd, our class attended the Aloud event, ‘Aloud in Revue: Banned Books’. During which we connected the attendees with a survey we had composed. I also created a sign with a trackable QR code to test the hypothesis: “In-person attendees can help grow the inline audience.”",
                "images": [
                    [
                        "/work/lfla/tiny-experiment.png",
                        "Joey standing next to a sign reading Invite a friend to watch the livestream. The sign also features a large QR code.",
                        "The QR code was not widely scanned, prompting different solutions from my team."
                    ],
                    [
                        "/work/lfla/qual-data-analysis.png",
                        "A collection of post-it notes on a wall that Joey used to analyze the survey results.",
                        "Qualitative analysis of the survey results."
                    ]
                ]
            },
            {
                "key": "field-research-insights",
                "componentType": "insightsScrollSection",
                "header": "Field Research Insights",
                "descriptiveList": [
                    [
                        "Hypothesis disproved",
                        "While the QR code had a total of 13 scans, these were entirely from fellow students and Aloud employees, proving the hypothesis false and somewhoat re-routing our project."
                    ],
                    [
                        "Quantitative results",
                        "30% of survey respondents knew little about Aloud and/or the topic before the event, emphasizing how important engagement tools are for awareness and retention."
                    ],
                    [
                        "Qualitative results",
                        "“In this program, the dialogue went very quickly. Sometimes I didn’t catch it all.”",
                        "“Too short!!”"
                    ]
                ]
            },
            {
                "key": "sme",
                "componentType": "standardScrollSection",
                "header": "Subject Matter Experts",
                "mainText": "Our research also consisted of three interviews with subject matter experts. These included:",
                "bullets": [
                    "Corey Kachigan, Internal Communications at Stitch Fix",
                    "Ted Habte-Gabr, Founder and Producer of Live Talks Los Angeles",
                    "Tiffany Colli-Moon, Program Producer at Aloud"
                ],
                "images": [
                    [
                        "/work/lfla/corey.jpeg",
                        "Corey Kachigan, one of our subject matter experts",
                        "Corey kachigan"
                    ],
                    [
                        "/work/lfla/ted.jpeg",
                        "Ted Habte-Gabr, one of our subject matter experts",
                        "Ted Habte-Gabr"
                    ],
                    [
                        "/work/lfla/tiffany-2.jpeg",
                        "Tiffany Colli-Moon, one of our subject matter experts",
                        "Tiffany Colli-Moon"
                    ]
                ]
            },
            {
                "key": "sme-insights",
                "componentType": "insightsScrollSection",
                "header": "Subject Matter Expert Insights",
                "descriptiveList": [
                    [
                        "Tell a story",
                        "Corey taught us the importance of storytelling when trying to drive donations. Tell viewers the story of LFLA - the story that they would be participating in by donating."
                    ],
                    [
                        "Use the chat for research",
                        "Ted opened our eyes to several live-stream pro-tips, including putting a survey in the chat during the countdown for research. This made its way into our final design."
                    ]
                ]
            },
            {
                "key": "corey-quote",
                "componentType": "mainText",
                "mainText": "“[storytelling] is about captivating people with the ‘why’ first and less about the ‘how’”",
                "postScript": "- Corey Kachigan"
            },
            {   
                "key": "design",
                "componentType": "chapterHeader",
                "header": "Design"
            },
            {
                "key": "pitch",
                "componentType": "billboard",
                "header": "Stakeholder Pitch",
                "mainText": "In week 9, we pitched these solutions to our stakeholders:",
                "images": [
                    [
                        "/work/lfla/teen-volunteers.png",
                        "A mockup of a YouTube video displaying a slide. The slide has pictures of teen volunteers and reads LFLA helped 1,270 teens impact their community in 2023.",
                        "The stream always starts with a slideshow, so I repurposed some of the slides to tell the story of how LFLA is impacting the community. Photos of people and faces creates an emotional underscore to the story, inspiring donation."
                    ],
                    [
                        "/work/lfla/upcoming-events-cropped.png",
                        "A mockup of a YouTube video, overlayed with a small graphic reading view upcoming events at lfla.org/calendar.",
                        "Another way to expose viewers to LFLA's brand is to supplement spoken content with info cards."
                    ],
                    [
                        "/work/lfla/polls.png",
                        "Two screenshots demonstrating how polls work. The first shows the moderator clicking 'start poll', while the second shows a lst of polls and their results.",
                        "Our solution inolved leveraging YouTube's live chat features. Above demonstrates how polls can be used to research the audience. We also planned to allow for general chat and Q-and-A participation. Our hope was to prevent drop-offs mid-stream."
                    ]
                ]
            },
            {
                "key": "stakeholder-feedback",
                "componentType": "insightsScrollSection",
                "header": "Stakeholder Feedback",
                "secondaryText": "Below is the feedback from our stakeholders, as well as adjustments we had to make in order to test our ideas live at the Aloud event, 'Where is our Democracy?' in Week 11.",
                "descriptiveList": [
                    [
                        "Slides",
                        "They asked me to add a QR code - linking to the donation page - to each of the slides I had designed."
                    ],
                    [
                        "Info-cards",
                        "While they loved the info-cards, they said that they couldn't be implemented in time for the event because it would require additional 3rd party softare."
                    ],
                    [
                        "Polls",
                        "Use polls to support the topic rather than research, which can distract. For research, we followed Ted's advice an put a survey at the end of the stream."
                    ]
                ]
            },
            {
                "key": "testing",
                "componentType": "standardScrollSection",
                "header": "Testing our Solutions",
                "mainText": "In week 11, we teamed up with Aloud's production team to show my slides in the slideshow before the talk, and to moderate the chat.",
                "images": [
                    [
                        "/work/lfla/moderating.jpg",
                        "Alison and Joey sit in the audience at the event, with their laptops open, moderating the chat.",
                        "Alison and I moderate the chat, post polls, and facilitate the Q-and-A session."
                    ],
                    [
                        "/work/lfla/slide-in-person.png",
                        "One of the slides Joey had designed, shown in front of the in-person audience.",
                        "One of the slides I had designed, with text overlaid on top by Aloud's staff. The slideshow was shown to both the in-person and remote audiences."
                    ],
                    [
                        "/work/lfla/chat.png",
                        "A screenshot of the chat during the livestream.",
                        "The chat and polls were lively."
                    ]
                ]
            },
            {
                "key": "results",
                "componentType": "insightsScrollSection",
                "header": "Results",
                "descriptiveList": [
                    [
                        "60% engagement",
                        "60% of viewers participated in the polls over the duration of the the stream, and two people freely commented about the topic. According to our secondary research, this kind of content co-creation prevents drop-offs and draws people back."
                    ],
                    [
                        "No questions",
                        "We gave the viewers the option to ask a question along with the in-person Q-and-A, but no one submitted anything."
                    ],
                    [
                        "Survey",
                        "One viewer responded to the survey we posted in the chat, demonstrating that this is a researchable audience."
                    ],
                    [
                        "0 scans",
                        "I had made the QR codes on the slides to be trackable, and I found that nobody scanned them. We iterated on the design for further testing."
                    ]
                ]
            },
            {
                "key": "final-presentation",
                "componentType": "standardScrollSection",
                "header": "Final Presentation",
                "mainText": "In week 13, we presented to the stakeholders our testing results and recommended next steps.",
                "images": [
                    [
                        "/work/lfla/presentation.png",
                        "The team standing behind a podium, presenting to the stakeholders.",
                        "The presentation was held at LA central library."
                    ],
                    [
                        "/work/lfla/handout.jpg",
                        "One of the team members passes out executive summaries to the stakeholders.",
                        "Ian hands out executive summaries to the stakeholders."
                    ],
                    [
                        "/work/lfla/feedback-2.jpg",
                        "Jessica provides feedback.",
                        "Jessica provides feedback."
                    ]
                ]
            },
            {
                "key": "next-steps-slides",
                "componentType": "video",
                "header": "Next steps: slides",
                "mainText": "Because the slides didn't get any scans, we recommended that the stakeholders keep iterating and testing the design. I kickstarted this process by creating these animated transitions - perhaps this will delight the viewers and build trust because it shows that LFLA cares about their experience.",
                "sources": [
                    "/work/lfla/transition.mp4"
                ],
                "hostType": "local",
                "isAutoPlay": true,
                "showControls": false,
                "isMuted": true
            },
            {
                "key": "next-steps-cards",
                "componentType": "video",
                "header": "Next steps: info-cards",
                "mainText": "The info cards were not tested because Aloud wouldn't have been able to implement them in time, as they require a 3rd party streaming platform. I therefore presented some options of platforms, a demo of how it looks from the streamer's end, and detailed instructions on how to customize the info cards so that they can be tailored to the topic. Lastly, I animated the info cards.",
                "sources": [
                    "/work/lfla/info-card-demo.mp4"
                ],
                "hostType": "local",
                "isAutoPlay": true,
                "showControls": false,
                "isMuted": true
            },
            {
                "key": "next-steps-chat",
                "componentType": "billboard",
                "header": "Next steps: chat moderation",
                "mainText": "Because the chat features were so engaging, we recommended that Aloud appoint someone to moderate the chat at all events. The stakeholders thought that this would be a great volunteering opportunity for employees of sponsoring corporations - a project they have been working on.",
                "images": [
                    [
                        "/work/lfla/moderating-2.png",
                        "Point of view of a chat moderator, with an open laptop in the foreground, and the speakers on stage in the background."
                    ]
                ]
            },
            {
                "key": "reflection",
                "componentType": "standardScrollSection",
                "header": "Reflection",
                "mainText": "This project contained a lot of uncharted territory for me that grew me in several ways: ",
                "bullets":[
                    "I gained research design skills. Of all my class projects, this one gave us the most freedom to design our research program as we saw fit.",
                    "This project was full of real-world restrictions that had to be navigated. For example, our testing opportunities were limited to the Aloud events calendar."
                ],
                "images": [
                    [
                        "/work/lfla/team-photo.jpg",
                        "The team posing beneath a sign at the library reading Creativity Starts Here",
                        "Yes. Yes it does."
                    ]
                ]
            }
        ]
    },
    "voxai": {
        "caseStudyCardProps": {
            "name": "VoxAI",
            "image": "/work/voxai/hi-fi-render.png",
            "page": "/work/voxai",
            "labels": [
                "UI for AI",
                "heuristics",
                "insight sorting",
                "project management",
                "accessibility"
            ]
        },
        "sections": [
            {
                "key": "overview",
                "componentType": "overview",
                "header": "VoxAI",
                "descriptiveList": [
                    [
                        "Users: ",
                        "Young adults with non-verbal autism."
                    ],
                    [
                        "User Pain Point: ",
                        "AAC (Assistive + Augmentative Communication) devices often leave users unable to communicate as swiftly and personally as they need to in all contexts."
                    ],
                    [
                        "Solution: ",
                        "Use AI to enhance the standard AAC model."
                    ],
                    [
                        "Team: ",
                        "Thanh Quach, Birgess Weston,  Lois Kim, Myself"
                    ],
                    [
                        "Role: ",
                        "Project Manager, Lead UI Designer"
                    ]
                ],
                "image": "/work/voxai/hi-fi-render.png"
            },
            {   
                "key": "research",
                "componentType": "chapterHeader",
                "header": "Research"
            },
            {   
                "key": "expert-interveiw",
                "componentType": "standardScrollSection",
                "header": "Expert Interveiw",
                "mainText": "We kicked off our project with an interview of an expert in AAC tech, AnnMarie Pence. She is a speech-language pathologist specializing in autism, and many of her pupils use AAC tablets and apps. She provided us with key information on the AAC landscape and common user pain points. ",                
                "bullets": [
                    "AAC apps facilitate communication for people with impaired speech due to autism, aphasia, stroke, or injury.",
                    "AAC apps are essentially keyboards representing words rather than letters. This is because users often have difficulty reading as well.",
                    "Once the user forms a desired sentence, the app can output it through an artificial voice.",
                    "The output can be enhanced through specialized cases that have speakers and a rear-facing screen for displaying text."
                    ],
                "images": [
                    [
                        "/work/voxai/ann-marie-pence.jpeg",
                        "Ann-Marie Pence",
                        "Ann-Marie Pence, speech and behavioral pathologist"
                    ], 
                    [
                        "/work/voxai/proloquo-dark-mode.png",
                        "Homepage of Proloquo, an industry leader in AAC tech.",
                        "Homepage of Proloquo, an industry leader in AAC tech."
                    ], 
                    [
                        "/work/voxai/tobii-dynavox.webp",
                        "Tobii Dynavox iPad case with a rear-facing screen",
                        "Tobii Dynavox makes AAc cases with rear-facing screens."
                    ]
                ]
            },
            {
                "key": "pain-points",
                "componentType": "insightsScrollSection",
                "header": "Pain Points",
                "secondaryText": "Common pain points for a non-verbal autistic user:",
                "descriptiveList": [
                    [
                        "Too Slow",
                        "Conversations held using AAC apps tend to be too slow because it takes time to find the right words within the app. Finding the right word is much like digging through folders in a computer’s file system."                    
                    ],
                    [
                        "Lack of personal touch",
                        "While users have some customizability over the vocal output, it sounds monotone and artificial. Users desire to use slang and emotional tones."                    
                    ],
                    [
                        "Dependence",
                        "Users can often only communicate with caregivers and people who understand AAC apps. Non-familar listeners often walk away from the conversation before it is over because the user can take a long time to respond."
                    ],
                    [
                        "Rigidity",
                        "Default words do not accommodate peculiar situations. If a user knows they are going to need a ‘fringe word’, they need to make a custom button ahead of time. Unexpected necessity of fringe words stalls conversations."
                    ]
                ]
            },
            {
                "key": "how-might-we",
                "componentType": "mainText",
                "secondaryText": "Based on our research, we saw a clear design direction:",
                "mainText": "How might we enhance the standard AAC model to help young adults with non-verbal autism communicate more swiftly, personally, independently, and versatilely?"
            },
            {
                "key": "ai-landscape",
                "componentType": "billboard",
                "header": "AI Landscape",
                "mainText": "We began to imagine that AI could be implemented into the solution, but needed a concrete understanding of what opportunities within AI were realistic. A ‘From…To’ map is useful for making predictions based on current trends - just what we needed.",
                "images": [
                    [
                        "/work/voxai/from-to.png",
                        "A From-To map used to explore AI trends"
                    ]
                ]
            },
            {
                "key": "Insights",
                "componentType": "insightsScrollSection",
                "header": "Insights",
                "secondarytext": "Relevant insights uncovered by the From-To map:",
                "descriptiveList": [
                    [
                        "Multimodality",
                        "There is an increase in the ability for a single model can more easily combine different kinds of media as input and output."                    
                    ],
                    [
                        "Democratization",
                        "Many companies are opting to use locally run, privately owned small language models because they are easier to manipulate, better at specific tasks, and cheaper."                    
                    ],
                    [
                        "Dramatization",
                        "AI models that produce a vocal output are able to emulate a wide range of emotions with minimal loading time."                    
                    ]
                ]
            },
            {
                "key": "Insights",
                "componentType": "insightsScrollSection",
                "header": "Designing for Autistic Users",
                "secondaryText": "Our interview with AnnMarie, as well as desktop research, revealed common heuristics for autistic users. They are mainly centered around avoiding overstimulation. While some of them align with typical design practices, many don’t. This was therefore an exercise in setting aside familiar practices in an effort to empathize.",
                "descriptiveList": [
                    [
                        "Layout",
                        "Layouts should be simple and hierarchical. Fanciful typographical tricks/animation should be avoided. Layout should be consistent across all pages without any major changes. There should only be one navigation toolbar."                    ],
                    [
                        "Colors",
                        "Colors should be muted, not bright. Stark color contrast should be avoided. "
                    ],
                    [
                        "Be Literal",
                        "Avoid using figurative language. Accompany icons with text in order to avoid ambiguity."
                    ],
                    [
                        "Fonts",
                        "Use a font that follows a hand-written structure. For instance, a's should be single story, not two story."
                    ]
                ]
            },
            {   
                "key": "precedent-exploration",
                "componentType": "standardScrollSection",
                "header": "Precedent Exploration",
                "mainText": "We analyzed the two most popular AAC apps in order to understand what opportunities for improvement exist concerning UI and what standards exist for such a niche user group. We decided to keep the following aspects of the typical AAC structure within our own UI",
                "bullets": [
                    "AAC apps adhere to the ‘Fistzgerald Key’ or a modified Fitzgerald Key in order to color code word types.",
                    "The typical ‘masonry’ layout of ordinary keyboards can be jarring to autistic users. A gridded keyboard layour is optimal.",
                    "Keys can be either represent words or word categories, much like how a computer’s file system has files and folders."
                ],         
                "images": [
                    [
                        "/work/voxai/fitzgerald-key.png",
                        "The modified Fitzgerald Key used by Proloquo",
                        "The modified Fitzgerald Key used by Proloquo"                        
                    ], 
                    [
                        "/work/voxai/lamp-home-screen.png",
                        "Lamp‘s homescreen.",
                        "Lamp‘s homescreen, with a gridded key layout."
                    ], 
                    [
                        "/work/voxai/proloquo-button-types.png",
                        "A sample of Proloquo's buttons",
                        "Proloquo's keys represent either words or folders."
                    ]
                ]
            },
            {   
                "key": "Design",
                "componentType": "chapterHeader",
                "header": "Design"
            },
            {   
                "key": "caseProcess",
                "componentType": "standardScrollSection",
                "header": "Tablet Case: Process",
                "mainText": "Part of our solution was an ipad case that originally included the following distinguishing features:",
                "bullets": [
                    "A rear screen that would supplement the user’s audio output with visual output. This would be useful in noisy places. Currently, there is only one case on the market that has a rear screen, and it has to be mounted to a wheelchair.",
                    "The screen would also be a stand, supporting both portrait and landscape.",
                    "A strap for portability",
                    "Padded corners for shock protection."
                ],         
                "images": [
                    [
                        "/work/voxai/sketches.png",
                        "Early thumbnail sketches created by Lois",
                        "Early thumbnail sketches created by Lois"                        
                    ], 
                    [
                        "/work/voxai/lo-fi-prototype.png",
                        "Lo-Fi Prototype",
                        "Lo-Fi prototype, with screen stand. Created by myself."
                    ], 
                    [
                        "/work/voxai/bill-of-materials.png",
                        "Bill of Materials",
                        "Bill of Materials, created by Birgess."
                    ],
                    [
                        "/work/voxai/hi-fi-prototype.jpg",
                        "Hi-Fi Prototype",
                        "Hi-Fi Prototype, with handle and screen. Created by Lois"
                    ],
                    [
                        "/work/voxai/hi-fi-render.png",
                        "Hi-Fi Render",
                        "Final render, modeled by Thanh."
                    ]
                ]
            },
            {
                "key": "tabletCaseRedirects",
                "componentType": "insightsScrollSection",
                "header": "Tablet Case: Redirects",
                "secondaryText": "For about two weeks we refined our prototypes, getting feedback from designers, professors, and our field expert, Ann-Marie Pence. Here are the major changes our design went through:",
                "descriptiveList": [
                    [
                        "Simplify the Screen",
                        "While our screen remained in the final iteration, we dropped the idea that it would serve also as a stand. Our research revealed that it would likely be too delicate for this. This was later confirmed by feedback we received later from product design expert Alexis Schlemer."
                    ],
                    [
                        "Sensory Overload",
                        "Discussions with autistic individuals, as well as internet research revealed that a tight strap on the neck would be too overstimulating for the majority of our audience, so we replaced the strap and grip with a swiveling grip, so the user can type while securely holding the ipad."
                    ],
                    [
                        "Slim it Down",
                        "Our original designs were shock-proof at the cost of size and weight. We decided to opt instead for lightness, as portability is one of our users’ central needs. "
                    ]
                ]
            },
            {   
                "key": "uiProcess",
                "componentType": "standardScrollSection",
                "header": "UI: Process",
                "mainText": "VoxAI Our follows the typical AAC structure used by Lamp and Proloquo. Our early iterations included the following distinguishing features:",
                "bullets": [
                    "AI generated word prediction. The word choice would be informed by geolocation and user habits.",
                    "AI generated images for custom buttons.",
                    "A feature that records the conversation and generates entire phrases for the user to respond with."
                ],         
                "images": [
                    [
                        "/work/voxai/layout.png",
                        "The layout of VoxAI's homepage",
                        "Lo-Fi wireframe outlining our layout."                        
                    ], 
                    [
                        "/work/voxai/listen-page-ideas.png",
                        "Iterations of the listening page",
                        "Four out of dozens of iterations on the listening feature."
                    ], 
                    [
                        "/work/voxai/flowchart.png",
                        "Flowchart",
                        "We created a flowchart to inform our UI decisions."
                    ]
                ]
            },
            {
                "key": "uiRedirects",
                "componentType": "insightsScrollSection",
                "header": "UI: Redirects",
                "secondaryText": "For about two weeks we refined our prototypes, getting feedback from designers, professors, and our field expert, Ann-Marie Pence. Here are the major changes our UI went through:",
                "descriptiveList": [
                    [
                        "Remove Customization",
                        "While AI generated imagery for custom buttons was a convenient feature, it did not directly address any of our users’ pain points."
                    ],
                    [
                        "Add Tones",
                        "One of our users’ pain points was an inability to express emotion and personality. Our original concept overlooked this need, so we added the ability for the user to control the emotional tone of the vocal output."
                    ],
                    [
                        "System Feedback",
                        "Our early iterations fell short of Jakob Nielsen’s first usability heuristic, which states, “The design should always keep users informed about what is going on, through appropriate feedback within a reasonable amount of time”."
                    ]
                ]
            },
            {   
                "key": "finalProduct",
                "componentType": "chapterHeader",
                "header": "Final Product"
            },
            {
                "key": "wordPrediction",
                "componentType": "video",
                "header": "Feature: Word Prediction",
                "mainText": "As the user types the VoxAI suggests words based on users’ habits, geolocation, and other optional forms of data.",
                "sources": [
                    "/work/voxai/word-prediction-A.mp4"
                ],
                "hostType": "local",
                "isAutoPlay": true,
                "showControls": false,
                "isMuted": true
            },
            {
                "key": "toneControl",
                "componentType": "video",
                "header": "Feature: Tone Control",
                "mainText": "The user can control the emotion of the vocal output using tone buttons. The default UI would have three for simplicity but more can be added of the user desires.",
                "sources": [
                    "/work/voxai/tones.mov"
                ],
                "hostType": "local",
                "isAutoPlay": true,
                "showControls": false,
                "isMuted": true
            },
            {   
                "key": "rearScreen",
                "componentType": "standardScrollSection",
                "header": "Rear Screen",
                "mainText": "The rear screen can supplement the audio output with visual output for the user's audience to read. This can be especially useful in noisy places. It also serves to alert the other member of the conversation when the conversation is being recorded.",      
                "images": [
                    [
                        "/work/voxai/rear-screen-1.png",
                        "The rear screen, alerting the user that they are being recorded",
                        "The rear screen gives essential system feedback"                        
                    ], 
                    [
                        "/work/voxai/rear-screen-2.png",
                        "The rear screen of the ipad case displaying the text, 'I'm Typing'",
                        "The rear screen helps the listener avoid prematurely leaving the conversation."
                    ], 
                    [
                        "/work/voxai/rear-screen-3.png",
                        "The rear screen displaying the text, 'Good to see you!'",
                        "The rear screen displays any text the user wants."
                    ]
                ]
            },
            {
                "key": "listening",
                "componentType": "video",
                "header": "Feature: AI Listening",
                "mainText": "VoxAI uses AI to suggest entire phrases based on audio from the conversation.",
                "sources": [
                    "/work/voxai/conversation-A.mov",
                    "/work/voxai/conversation-B.mov"
                ],
                "hostType": "local",
                "isAutoPlay": true,
                "showControls": false,
                "isMuted": true
            },
            {   
                "key": "reflection",
                "componentType": "chapterHeader",
                "header": "Reflection"
            },
            {   
                "key": "projectManagement",
                "componentType": "standardScrollSection",
                "header": "Project Management",
                "mainText": "In addition to acting as the UI lead, I had the privilege of being the project manager for this team. This included creating a timeline before any of the work began, creating agendas for meetings, and sending a weekly report to our stakeholders.",      
                "images": [
                    [
                        "/work/voxai/raci-matrix.png",
                        "A spreadsheet outlining all of the projected work for the project",
                        "I used a RACI Matrix to plan out every step of the project before we began."                        
                    ]
                ]
            },
            {
                "key": "next-steps",
                "componentType": "insightsScrollSection",
                "header": "Next Steps",
                "descriptiveList": [
                    [
                        "Usability Tests",
                        "While our VoxAI has the approval of AnnMarie, our field expert, we are yet to test it in the hands of actual users. I’m certain that this would generate many more rounds of refinements."
                    ],
                    [
                        "GIF Integration",
                        "We see ways to further address our second pain point on the lack of personal touch. One such concept is to give VoxAI access to a GIF library so the user can display GIFs on the rear screen."
                    ],
                    [
                        "Tones Integration",
                        "Another concept for addressing our second pain point is to allow the tones to be reflected in the rear screen display. This would enable our users to express more emotion in their conversations."
                    ]
                ]
            }
        ],
        "terminus": "terminus"
    },
    "slimbox": {
        "caseStudyCardProps": {
            "name": "SlimBox",
            "image": "/work/slimbox/swot.png",
            "page": "/work/slimbox",
            "labels": [
                "S.W.O.T.",
                "micro-interactions",
                "precedent exploration"
            ]
        },
        "sections": [
            {
                "key": "overview",
                "componentType": "overview",
                "header": "SlimBox",
                "descriptiveList": [
                    [
                        "Problem: ",
                        "Users are often overwhelmed by the size of their inbox and can't keep their inbox empty."
                    ],
                    [
                        "Solution: ",
                        "A UI that helps users arrange all their unread emails into a sequential and segmented flow, meant to speed up the process of decluttering an inbox."
                    ],
                    [
                        "Process: ",
                        "SWOT analysis, precedent exploration, flowchart, prototype, refine."
                    ]
                ],
                "image": "/work/slimbox/swot-2.png"
            },
            {
                "key": "project-brief",
                "componentType": "mainText",
                "secondaryText": "Excerpt from the project brief:",
                "mainText": "\"... redesign the micro-interactions users have with desktop email clients ... we will focus our attention on the ability or micro-interactions to make those digital chores easier, simpler, more enjoyable - and less noticeable.\""
            },
            {   
                "key": "research",
                "componentType": "chapterHeader",
                "header": "Research"
            },
            {
                "key": "swot-analysis",
                "componentType": "standardScrollSection",
                "header": "S.W.O.T.",
                "mainText": "A S.W.O.T. analysis (Strengths, Weaknesses, Opportunities, Threats) is a way to analyze the competitive landscape and inform design decisions. I used this method to examine three existing email clients - Gmail, Outlook, and Apple Mail. Here are my main findings.",
                "bullets": [
                    "Strength: All  clients have a toolbar with reply, delete, and actions.",
                    "Weakness: Addressing unread emails can be a very back and forth process. This can make it slow and stressful.",
                    "Opportunity: Take all the things users can do with unread emails and arrange it into a single rewarding flow.",
                    "Opportunity: Help people keep their inbox empty."
                ],
                "images": [
                    [
                        "/work/slimbox/strengths.png",
                        "The strengths section of the SWOT analysis"
                    ],
                    [
                        "/work/slimbox/weaknesses.png",
                        "The weaknesses section of the SWOT analysis"
                    ],
                    [
                        "/work/slimbox/opportunities.png",
                        "The opportunities section of the SWOT analysis"
                    ],
                    [
                        "/work/slimbox/threats.png",
                        "The thresats section of the SWOT analysis"
                    ]
                ]
            },
            {
                "key": "design-direction",
                "componentType": "mainText",
                "secondaryText": "The S.W.O.T. analysis led me to adopt this design direction:",
                "mainText": "How might I make the process of decluttering one's inbox more streamlined, easy, and delightful?"
            },
            {   
                "key": "precedent-exploration",
                "componentType": "standardScrollSection",
                "header": "Precedent Exploration",
                "mainText": "The next step was to look at existing UI's that tackle the same issue as me. I was evaluating them for examples to follow and non-examples to avoid.",
                "bullets": [
                    "Responding to emails can be as tedious as doing taxes. TurboTax uses a progress bar to encourage and reward the user.",
                    "Outlook's toolbar for handling an email includes moving to a folder, deleting, flagging, and replying.",
                    "Gmail has useful left and right arrows for moving to consecutive and previous emails. This makes the user experience more flowing.",
                    "Hey has a 'Focus and Reply' mode that allows users to reply to selected emails in a scroll."
                ],         
                "images": [
                    [
                        "/work/slimbox/hey-outline.png",
                        "Screenshot of HeyMail's 'Focus and Reply' mode",
                        "Hey's Focus and Reply mode helps the user flow through responding to emails."                        
                    ], 
                    [
                        "/work/slimbox/turbotax-outline.png",
                        "'Turbotax's progess bar.",
                        "TurboTax's progress bar"
                    ]
                ]
            },
            {   
                "key": "design",
                "componentType": "chapterHeader",
                "header": "Design"
            },
            {
                "key": "flowchart",
                "componentType": "billboard",
                "header": "Flowchart",
                "mainText": "This flowchart outlines my solution, which includes user-dictated categorization and a progress bar.",
                "images": [
                    [
                        "/work/slimbox/slimbox-flowchart.png",
                        "A flowchart outlining the 'Declutter Inbox' feature"
                    ]
                ]
            },
            {
                "key": "mid-fi-ui",
                "componentType": "iFrame",
                "header": "Mid-Fidelity UI",
                "mainText": "This project was an exercise in playing with micro-interactions, and did not involve any branding, so this mid-fidelity UI was the final deliverable. Take it for a spin!",
                "src": "https://www.figma.com/embed?embed_host=share&url=https%3A%2F%2Fwww.figma.com%2Fproto%2F03fMbGdhWZTUtRot9hSkfp%2FSlimBox%3Fpage-id%3D0%253A1%26node-id%3D6-212%26viewport%3D-1021%252C-315%252C0.07%26t%3DzDpKzIYiXPuAh661-1%26scaling%3Dscale-down-width%26starting-point-node-id%3D6%253A212"
            },
            {
                "key": "further-possibilities",
                "componentType": "paragraph",
                "header": "Further Possibilities",
                "mainText": "I see this project as a small contribution to a larger trend of rethinking email clients. While this movement has some clear trailblazers such as Hey or Sparkmail, I hope that this example of gaining inspiration from other contexts will help inspire designers who are tackling these issues. Always remember to think outside the (in)box."
            }
        ]
    },
    "semiotic-clock": {
        "caseStudyCardProps": {
            "name": "Semiotic Clock",
            "image": "/work/semiotic-clock/semiotic-clock-cover.png",
            "page": "/work/semiotic-clock",
            "labels": [
                "processing",
                "p5js",
                "O.O.P."
            ]
        },
        "sections": [
            {
                "key": "overview",
                "componentType": "overview",
                "header": "Semiotic Clock",
                "descriptiveList": [
                    [
                        "Context: ",
                        "This project was my submission for a coding challenge as part of a programming class."
                    ],
                    [
                        "Challenge: ",
                        "Create an animation that shows a clock for aliens. The clock cannot display time tied to the rotation of the Earth - years, months, days, hours, minutes, etc. Instead create your own system of time - however large or small."
                    ],
                    [
                        "Tools: ",
                        "Processing, p5js"
                    ]
                ],
                "image": "/work/semiotic-clock/semiotic-clock-cover.png"
            },
            {   
                "key": "process",
                "componentType": "chapterHeader",
                "header": "Process"
            },
            {
                "key": "inspiration",
                "componentType": "billboard",
                "header": "Inspiration",
                "mainText": "For the 1979 'Alien' movie, concept artist Ron Cobb designed a set of signs that follow a visual language he called 'Semiotic Standard'. I decided to make the clock follow this language because of it's minimalist, wordless clarity.",
                "images": [
                    [
                        "/work/semiotic-clock/semiotic-standard-captions.png",
                        "Semiotic Standard"
                    ]
                ]
            },
            {
                "key": "concept",
                "componentType": "billboard",
                "header": "Concept",
                "mainText": "As a basis for measuring time, I used what I call death-spans. This is the amount of time that a passenger can survive without water.",
                "images": [
                    [
                        "/work/semiotic-clock/semiotic-clock-concept.png",
                        "Semiotic Clock Concept"
                    ]
                ]
            },
            {
                "key": "final-product",
                "componentType": "iFrame",
                "header": "Final Product",
                "mainText": "The clock displays the amount of time left until the ship runs out of various resources, measured in death-spans. Additionally, the visor begins to flash when a metric runs out. The clock shown here is accelerated.",
                "src": "https://editor.p5js.org/jsotelo/full/seEN0FM1T"
            },
            {
                "key": "metricObject",
                "componentType": "codeFragmentBillboard",
                "header": "Metric Object",
                "mainText": "Instead of hard-coding the coordinates for all the metrics and their segments, I designed a Metric class and a Segment class. They dynamically render the metric bars based on a simple object declaration in which the developer defines the resource type, the color, they quantity, and a numeric key. Voila!",
                "lines": [
                    [
                        "metrics.push(new Metric('water', 1,'blue', 5));",
                        "metrics.push(new Metric('oxygen', 2,'teal', 7));"
                    ],
                    [
                        "metrics.push(new Metric('water', 1,'blue', 5));",
                        "metrics.push(new Metric('oxygen', 2,'teal', 7));",
                        "metrics.push(new Metric('food', 3,'green', 15));",
                        "metrics.push(new Metric('power', 4,'yellow', 12));"
                    ]
                ],
                "images": [
                    [
                        "/work/semiotic-clock/water-oxygen.png",
                        "Two Metrics"
                    ],
                    [
                        "/work/semiotic-clock/food-electricity.png",
                        "Four metrics"
                    ]
                ]
            }
        ]
    },
    "electric-spoons": {
        "caseStudyCardProps": {
            "name": "Electric Spoons",
            "image": "/work/electric-spoons/electric-spoons-cover.png",
            "page": "/work/electric-spoons",
            "labels": [
                "processing",
                "arduino"
            ]
        },
        "sections": [
            {
                "key": "overview",
                "componentType": "overview",
                "header": "Electric Spoons",
                "descriptiveList": [
                    [
                        "Mode: ",
                        "These spoons are meant for live performance and practice sessions."
                    ],
                    [
                        "Sound: ",
                        "Currently, the spoons trigger a synthesized sound. However, future iterations may include a variety of samples."
                    ],
                    [
                        "Visuals: ",
                        "A red dot displays whenever sound is produced."
                    ],
                    [
                        "Sensors: ",
                        "The prototype has one sensor, a button that detects when the spoons are being 'clacked' together"
                    ]
                ],
                "image": "/work/electric-spoons/electric-spoons-cover.png"
            },
            {
                "key": "functional-prototype",
                "componentType": "video",
                "header": "Functional Prototype",
                "mainText": "The below model protypes technical functionality. Created with Arduino and Adafruit hardware. Programmed in Processing.",
                "sources": [
                    "/work/electric-spoons/electric-spoons-demo.MOV"
                ],
                "hostType": "local",
                "isAutoPlay": false,
                "showControls": true,
                "isMuted": false
            }
        ]
    },
    "discover-olvera": {
        "caseStudyCardProps": {
            "name": "Discover Olvera",
            "image": "/work/discover-olvera/discover-olvera-cover.png",
            "page": "/work/discover-olvera",
            "labels": [
                "ethnography",
                "netnography",
                "prototyping",
                "user testing",
                "animated logo"
            ]
        },
        "sections": [
            {
                "key": "overview",
                "componentType": "overview",
                "header": "Discover Olvera",
                "descriptiveList": [
                    [
                        "Problem: ",
                        "Olvera Street's businesses are suffering due to a lingering, pandemic-enduced drop in foot traffic"
                    ],
                    [
                        "Process: ",
                        "Ethnography, Netnography, Prototype, Test, Refine"
                    ],
                    [
                        "Solution: ",
                        "A mobile app that aims to increase foot traffic at Olvera street by gamifying the visitor experience using augmented reality."
                    ],
                    [
                        "Team: ",
                        "Erick Olivares, Ian Goldstein, Tony Renoj, Myself"
                    ],
                    [
                        "Role: ",
                        "Design Research, Branding, UX Design"
                    ]
                ],
                "image": "/work/discover-olvera/discover-olvera-cover.png"
            },
            {   
                "key": "research",
                "componentType": "chapterHeader",
                "header": "Research"
            },
            {
                "key": "observations",
                "componentType": "standardScrollSection",
                "header": "Ethnography: Observations",
                "mainText": "Our first form of research was to visit Olvera Street in person. The goal was to unearth problems through observation",
                "bullets": [
                    "Six shops and one popular resturant were closed down.",
                    "There were many transient individuals within Olvera Street, and we witnessed an attempted theft - perhaps they feel emboldened to steal because of the low foot traffic.",
                    "Olvera Street is part of a slightly larger area known as Placita Olvera, which houses five small museums. These Museums are under-promoted, gaining most visitors through outdoor signs, scheduled visits from guided tours, and seasonal events."
                ],
                "images": [
                    [
                        "/work/discover-olvera/firehouse-museum.png",
                        "Exterior view of the Firehouse Museum. It is an old-fashioned brick building in a cobblestone plaza",
                        "The Firehouse Museum, one of many hidden gems of Placita Olvera"
                    ],
                    [
                        "/work/discover-olvera/olvera-empty.png",
                        "Vacant shops at Olvera Street",
                        "Vacant shops at Olvera Street"           
                    ]
                ]
            },
            {
                "key": "interviews",
                "componentType": "standardScrollSection",
                "header": "Ethnography: Interviews",
                "mainText": "In addition to observations, we interviewed 7 vendors, 5 visitors, and 2 museum clerks.",
                "bullets": [
                    "All vendors concurred that they have not recovered economically from Covid.",
                    "The Museums have a lot to offer but are mainly promoted through entrance signage. They are hidden gems",            
                    "Frequent visitors tend to naturally promote Olvera street to their friends and family."
                ],
                "images": [
                    [
                        "/work/discover-olvera/mural-a.jpg",
                        "The mural 'America Tropical' by David Alfaro Siquieros",
                        "'America Tropical', a mural by David Alfaro Siquieros, lies right in the center of Olvera Street but can only be viewed from a one particular balcony"
                    ],
                    [
                        "/work/discover-olvera/museum-of-social-justice.png",
                        "Entrance to the Museum of Social Justice",
                        "Another one of Placita Olvera's hidden gems"
                    ]
                ]
            },
            {
                "key": "netnography",
                "componentType": "standardScrollSection",
                "header": "Netnography",
                "mainText": "Next, we took an in-depth look at the online presence of Olvera Street. We investigated what’s said about Olvera on Yelp, Tripadvisor, and in the news. We also looked what others have already done to solve similar challenges.",
                "bullets": [
                    "The Met used an AR app to enhance artwork and draw the crowds back after Covid. Should we use AR to increase foot traffic at Olvera?",
                    "Placita Olvera has poor internet representation. For example, many shops are not represented on Google Maps",            
                    "We found qualitative data that confirmed our ethnography, such as the fact that businesses are currently down 30-60%",
                    "Journalist Javier Cabral suggests that leveraging social media could be a solution. How might this look in our project?"
                ],
                "images": [
                    [
                        "/work/discover-olvera/google-maps.png",
                        "Screenshot of Olvera Street on Google maps",
                        "Many businesses at Olvera are not displayed on Google and Apple maps."
                    ],
                    [
                        "/work/discover-olvera/chroma.png",
                        "Image of text reading 'Chroma: ancient sculpture in color' in front of a Sphinx sculpture",
                        "Poster for Chroma AR by The MET"
                    ]
                ]
            },
            {
                "key": "how-might-we",
                "componentType": "mainText",
                "secondaryText": "After reviewing our data, a design direction emerged:",
                "mainText": "How might we leverage Olvera's hidden museums and it's small yet loyal customer base to increase foot traffic at Olvera Street?"
            },
            {
                "key": "persona",
                "componentType": "standardScrollSection",
                "header": "Persona",
                "mainText": "We created a persona named Jessica based on the visitors that we interviewed. Our design, whatever it would end up being, would focus on bringing her pysically to Olvera Street.",
                "images": [
                    [
                        "/work/discover-olvera/persona-left.png",
                        "Screenshot of the Jessica Persona"
                    ], 
                    [
                        "/work/discover-olvera/persona-right.png",
                        "Screenshot of the Jessica Persona"
                    ]
                ]
            },
            {   
                "key": "design",
                "componentType": "chapterHeader",
                "header": "Design"
            },
            {
                "key": "paper-prototype",
                "componentType": "standardScrollSection",
                "header": "Paper Prototype",
                "mainText": "The first iteration of our solution was a system consisting of several digital and physical components.",
                "bullets": [
                    "App: An app with a detailed map of Olvera’s attractions, as well as AR experiences.",
                    "Digital Displays: Users would have the opportunity to post photos of their experiences to digital displays on billboards in public.",            
                    "QR Codes: QR codes at Olvera street would have to be scanned to download the app and activate the AR experiences."
                ],
                "images": [
                    [
                        "/work/discover-olvera/paper-prototype.png",
                        "The app prototype, made of paper and lego",
                        "Lego makes a great prototyping material!"
                    ], 
                    [
                        "/work/discover-olvera/camera-sim.png",
                        "The app prototype, made of paper and lego",
                        "Simulating an AR-colorized mural"
                    ],
                    [
                        "/work/discover-olvera/prototype-map.png",
                        "The app prototype, made of paper and lego",
                        "Simulating physical movement around the location"
                    ]
                ]
            },
            {
                "key": "prototype-insights",
                "componentType": "insightsScrollSection",
                "header": "Insights",
                "secondaryText": "Several usability tests of our paper prototype revealed these insights:",
                "descriptiveList": [
                    [
                        "Comfort Levels",
                        "All of our participants said that they would be uncomfortable sharing their photos to public displays and billboards."
                    ],
                    [
                        "America Tropical",
                        "We prototyped three AR experiences, and the most delightful was the one that displayed America Tropical, a white-washed mural, in its original colors."
                    ],
                    [
                        "Emphasize AR",
                        "The user flow needs to culminate in sharing AR experiences, rather than just having them."
                    ]
                ]
            },
            {
                "key": "mid-fi-prototype",
                "componentType": "standardScrollSection",
                "header": "Mid-Fi Prototype",
                "mainText": "We used our insights to design an interactive mid-fidelity prototype in Figma.",
                "bullets": [
                    "We discarded the idea of sharing photos to public digital displays. Instead, we aimed to provoke users to share their experiences on their own social media. This would be done by rewarding users with camera filters for participtation in AR experiences.",
                    "We built out the AR mural feature to include a variety of interactions.",            
                    "We made the AR more prominent from the very beginning of the user journey"
                ],
                "images": [
                    [
                        "/work/discover-olvera/broken-statues.png",
                        "A screen from the app showing an AR enhanced mural.",
                        "One of our new features for the mural was informative popovers."
                    ] 
                ]
            },
            {
                "key": "mid-fi-insights",
                "componentType": "insightsScrollSection",
                "header": "Insights",
                "secondaryText": "Several usability tests of our first Figma prototype revealed these insights:",
                "descriptiveList": [
                    [
                        "Tutorial",
                        "Many of the participants in our digital usability tests suggested including some kind of tutorial or abundance of tooltips."            
                    ],
                    [
                        "Simplify",
                        "Several participants mentioned that there were too many clicks in the map and the tutorial"            
                    ],
                    [
                        "Delighted by AR",
                        "Our participants cherished all of the new AR mural features, suggesting that this formula be applied to other muesum exhibits at Olvera."            
                    ],
                    [
                        "Be careful about Spanish phrases",
                        "Our prototype had some phrases like 'Vamos!'. Some participants said they didn't understand what these phrases meant and that they would look for a way to switch to English."
                    ]
                ]
            },
            {   
                "key": "branding",
                "componentType": "standardScrollSection",
                "header": "Branding",
                "mainText": "I designed all aspects of the brand with feedback from my team. Like the structure and UI of the app, the branding went through a sustained iterative process.",
                "bullets": [
                    "The interviews with vendors had revealed that Dia de los Muertos, as well as the movie 'Coco' generated a lot of foot traffic. We chose a style that was reminiscent of these themes, using festive colors contrasted by dark backgrounds.",
                    "Through Figma’s Material Theme Builder plugin, I was able to enter our colors and quickly customize a UI kit for our Hi-Fi wireframes."           
                ],
                "images": [
                    [
                        "/work/discover-olvera/discover-olvera-logo.png",
                        "The final logo",
                        "The final logo"
                    ], 
                    [
                        "/work/discover-olvera/color-palette.png",
                        "Discover Olvera color palette",
                        "Color palette for the brand"
                    ], 
                    [
                        "/work/discover-olvera/ui-colors.png",
                        "Color palette for the UI",
                        "Color palette for the app's UI"
                    ],
                    [
                        "/work/discover-olvera/olvera-logo-thumbnails.png",
                        "Thumbnail sketches for the logo",
                        "An early set of logo ideas"
                    ],
                    [
                        "/work/discover-olvera/figma-logo-ideation.png",
                        "Digital logo ideas",
                        "Later refinements of the wordmark"
                    ]
                ]
            },
            {
                "key": "hi-fi-prototype",
                "componentType": "video",
                "header": "Hi-Fi Prototype and user story",
                "mainText": "Below is our final deliverable - a video showcasing our hi-fi protoype through a user story. The animated infographics at the beginning were created by myself in After Effects.",
                "sources": [
                    "https://www.youtube.com/embed/ZsmuhoPbTFE"
                ],
                "hostType": "iframe",
                "isAutoPlay": true,
                "showControls": false,
                "isMuted": true
            },
            {
                "key": "reflection",
                "componentType": "standardScrollSection",
                "header": "Reflection",
                "bullets": [
                    "This was, by far, the most research-intensive project I’ve done so far. I got to practice familiar research methods and learn a new one - ethnography. I am more confident now in my ability to design a research program and execute it, tailored to the needs of the project.",
                    "We made use of one another’s varied skillsets to share the load in a productive way. I will be looking for this kind of opportunity in future teams."
                ],
                "images": [
                    [
                        "/work/discover-olvera/team-photo.png",
                        "Team Photo",
                        "Tony, Erick, and I Discovering Olvera"
                    ]
                ]
            }
        ]
    },
    "other": {
        "caseStudyCardProps": {
            "name": "Other Stuff I Do",
            "image": "/work/other/other-cover.png",
            "page": "/work/other",
            "labels": [
                "typography",
                "book illustration",
                "digital art",
                "analog art"
            ]
        },       
        "sections": [
        
        ]
    },
    "bird-feeder": {
        "caseStudyCardProps": {
            "name": "Bird Feeder",
            "image": "/work/other/other-cover.png",
            "page": "/work/bird-feeder",
            "labels": [
                "data viz",
                "arduino",
                "js"
            ]
        },       
        "sections": [
            {
                "key": "overview",
                "componentType": "overview",
                "header": "Spying on Birds",
                "descriptiveList": [
                    [
                        "Context: ",
                        "This project was my final project for Tangible Interactions, a course focusing on programming and the IoT."
                    ],
                    [
                        "Challenge: ",
                        "Use digital sensors to collect data from my house for a day. Write a program that will process and visualize the data live."
                    ],
                    [
                        "Submission: ",
                        "I created a bird feeder that detects whenever a bird is feeding on it. I placed it in a large, walk-in bird cage. The data was then vizualized using a heatmap-style infographic created with javascript."
                    ],
                    [
                        "Tools: ",
                        "Adafruit hardware, Arduino, P5js"
                    ]
                ],
                "image": "/work/bird-feeder/bird-feeder-cover.png"
            },
            {   
                "key": "hardware",
                "componentType": "chapterHeader",
                "header": "Hardware"
            },
            {
                "key": "piezo",
                "componentType": "billboard",
                "header": "Piezo Sensor",
                "mainText": " I used a piezoelectric sensor to detect vibrations from birds using the feeder. The sensor sends analog data based on vibration, knocking, and other disturbances.",
                "images": [
                    [
                        "/work/bird-feeder/piezo.png",
                        "The piazo sensor, which looks like a copper disc with red and black wires attached."
                    ]
                ]
            },
            {
                "key": "feeder-base",
                "componentType": "billboard",
                "header": "Feeder Base",
                "mainText": "At the base of the feeder is where the sensor is housed. It’s attached to a tympanic membrane( a.k.a. The lid of a can), which is attached to four perches. The rocks serve as a ballast.",
                "images": [
                    [
                        "/work/bird-feeder/feeder-base.png",
                        "The base of the bird feeder, which is the bottom half of a water bottle, filled with rocks. Towards the top there are four prongs coming out, with a piazo sensor attached where the prongs intersect."
                    ]
                ]
            },
            {
                "key": "feeder-cannister",
                "componentType": "billboard",
                "header": "Feeder Cannister",
                "mainText": "A canister attaches to the base holds the bird food. The feeding holes are placed so that the birds will sit on the perches, triggering the sensor.",
                "images": [
                    [
                        "/work/bird-feeder/feeder-cannister.png",
                        "The feeder base, with the upper half of a water bottled attached on top, with holes for birds to access food."
                    ]
                ]
            },
            {
                "key": "micro-and-battery",
                "componentType": "billboard",
                "header": "Microcontroller and Battery",
                "mainText": "An ESP32 microcontroller and battery attached to the feeder by a wire. I couldn’t put them within the feeder because the feeder itself was going to be placed outside of wifi-range.",
                "images": [
                    [
                        "/work/bird-feeder/micro.png",
                        "A water bottle, with circuitry visible inside."
                    ]
                ]
            },
            {   
                "key": "software",
                "componentType": "chapterHeader",
                "header": "Software"
            },
            {
                "key": "overview",
                "componentType": "paragraph",
                "header": "Overview",
                "mainText": "The microcontroller sends the values via wifi to an Adafruit IO feed. The feed is accessed, processed, and displayed by my p5js program via API."
            },
            {
                "key": "data-viz",
                "componentType": "billboard",
                "header": "Data Visualization",
                "mainText": "The program displays the data as a heat map. Each rectangle corresponds to a timespan, and the intensity of the signals within each timespan affects the color.",
                "images": [
                    [
                        "/work/bird-feeder/data-viz.png",
                        "A heat-map stle infographic representing the bird feeding habits"
                    ]
                ]
            },
            {
                "key": "granularity",
                "componentType": "billboard",
                "header": "Granularity",
                "mainText": "The granularity of the data can be easily adjusted by changing one variable. This changes the amount of time represented by each bar.",
                "images": [
                    [
                        "/work/bird-feeder/grain.png",
                        "A heat-map stle infographic representing the bird feeding habits"
                    ]
                ]
            },
            {
                "key": "more-feeders",
                "componentType": "billboard",
                "header": "More Feeders",
                "mainText": "Multiple feeders can be placed in different locations and compared on the heatmap. This can be accomplished by simply adding a URL to the feederURLs array at the top of sketch.js",
                "images": [
                    [
                        "/work/bird-feeder/bird-feeder-cover.png",
                        "A heat-map stle infographic representing the bird feeding habits"
                    ]
                ]
            },
            {   
                "key": "testing",
                "componentType": "chapterHeader",
                "header": "Testing"
            },
            {
                "key": "lab-test",
                "componentType": "video",
                "header": "Lab Test",
                "mainText": "I first tested that the sensor was active and sending data to the feed.",
                "sources": [
                    "/work/bird-feeder/lab-test.MOV"
                ],
                "hostType": "local",
                "isAutoPlay": true,
                "showControls": false,
                "isMuted": true
            },
            {
                "key": "field-test",
                "componentType": "video",
                "header": "Field Test",
                "mainText": "I then set up all the hardware in one of my neighbor's bird large bird cages.",
                "sources": [
                    "/work/bird-feeder/field-test.MOV"
                ],
                "hostType": "local",
                "isAutoPlay": true,
                "showControls": false,
                "isMuted": true
            },
            {
                "key": "setup",
                "componentType": "billboard",
                "header": "Setup",
                "mainText": "I placed the feeder in the cage, with the microcontroller/battery unit around the corner for best wifi access. It ran for 22 hours.",
                "images": [
                    [
                        "/work/bird-feeder/setup.png",
                        "Exterior view of the bird cage, with the feeder inside, the microcontroller/battery unit outside, and a wire running through the cage connecting them both."
                    ]
                ]
            },
            {
                "key": "results",
                "componentType": "billboard",
                "header": "Results",
                "mainText": "While the device functioned properly, the birds didn’t use it! I had it running for 22 hours, I removed the other feeders, and I swept away any seeds on the ground, but they were still suspicious about this unfamiliar feeder.",
                "images": [
                    [
                        "/work/bird-feeder/results.png",
                        "The heatmap, displaying zero bird activity."
                    ]
                ]
            },
            {
                "key": "insights",
                "componentType": "insightsScrollSection",
                "header": "Next Steps",
                "descriptiveList": [
                    [
                        "Pagination",
                        "Implement API pagination in order to display all of the data at once."
                    ],
                    [
                        "Feeder design",
                        "The owner of the birds recommended removing the canister and pouring seeds into the lower housing. This will make the feeder less scary-looking. Alternatively, I could place the try attaching piezo sensors to the existing feeders."
                    ]
                ]
            },
            {
                "key": "code-link",
                "componentType": "bigText",
                "secondaryText": "View my code at:",
                "mainText": "https://editor.p5js.org/jsotelo/sketches/RUI10B5l7"
            }
        ]
    }
}